module.exports = [
  {
    title: "ΕΠΕΞΕΡΓΑΣΙΑ ΣΤΟΧΑΣΤΙΚΟΥ ΣΗΜΑΤΟΣ",
    description:
      "Αξιωματική θεωρία πιθανοτήτων. Επαναλαμβανόμενα πειράματα τύχης. Τυχαία μεταβλητή. Συναρτήσεις τυχαίων μεταβλητών. Στατιστικές ιδιότητες από-κοινού. Ροπές και υπό-συνθήκη στατιστικές ιδιότητες. Στοχαστικά σήματα. Βασικές κατηγορίες στοχαστικών σημάτων (Γκαουσιανό, Μαρκοβιανό, Στάσιμο, Εργοδικό). Στατιστική συνάρτηση αυτοσυσχέτισης και ετεροσυσχέτισης. Σχέση εισόδου-εξόδου γραμμικού συστήματος με στοχαστική διέγερση. Θεωρία βέλτιστων γραμμικών συστημάτων. Εκτίμηση μέσου τετραγωνικού σφάλματος.",
  },
  {
    title: "ΑΝΑΓΝΩΡΙΣΗ ΠΡΟΤΥΠΩΝ - ΣΤΑΤΙΣΤΙΚΗ ΜΑΘΗΣΗ",
    description:
      "Ομαδοποίηση (μη επιβλεπόμενη μάθηση). Κατάταξη/ταξινόμηση (επιβλεπόμενη μάθηση). Συναρτήσεις απόφασης. Εκπαιδευόμενοι αλγόριθμοι κατάταξης με συναρτήσεις απόφασης. Κατάταξη με βάση την απόσταση. Κατάταξη με βάση την θεωρία αποφάσεων. Μάθηση παραμέτρων κατανομών. Ημι-επιβλεπόμενη μάθηση. Ελάττωση διαστάσεων (Ανάλυση πρωτευουσών συνιστωσών, Ανάλυση διακριτικής ικανότητας). Μέθοδοι αναγνώρισης προτύπων με γράφους (Ανάλυση γράφων ομοιότητας και διαδικτύου, Φασματική ομαδοποίηση). Ασαφής λογική και αναγνώριση προτύπων. Γκαουσιανά μειξιακά μοντέλα. Μπαιεσιανά δίκτυα. Εργασίες προγραμματισμού αναγνώρισης προτύπων σε Python, C/C++ ή MATLAB. Βιβλιογραφικές εργασίες.",
  },
  {
    title: "ΥΠΟΛΟΓΙΣΤΙΚΗ ΒΙΟΛΟΓΙΑ",
    description:
      "Εισαγωγή στη βιολογία, και στην υπολογιστική βιολογία. Πρόσβαση σε δεδομένα ακολουθιών (και άλλων στοιχείων), στοίχιση ακολουθιών ανά ζεύγος, BLAST και άλλες μέθοδοι αναζήτησης σε βάσεις δεδομένων, πολλαπλή στοίχιση ακολουθιών, και φυλογένεση. Λειτουργική γονιδιωματική, από το DNA (συμπεριλαμβανομένων στοιχείων αλληλούχισης επόμενης γενεάς) στο RNA (συμπεριλαμβανομένου του RNASeq) και πρωτεινών. Το δένδρο της ζωής από άποψη γονιδιωματικής, ιοί, βακτήρια και αρχαία, και οι ευκαρυώτες.",
  },
  {
    title: "ΔΙΕΠΑΦΕΣ ΦΟΡΗΤΩΝ ΣΥΣΚΕΥΩΝ ",
    description:
      "Περιγραφή των διεπαφών και των λειτουργιών ενός τυπικού φορητού συστήματος. Τα στοιχεία εισόδου (keyboards, chord keyboards, phone pads, handwriting devices, gyroscopes, physical control sensors, iDrives κ.α.) και εξόδου (πολλαπλές οθόνες, μεγάλες -large- οθόνες, situated displays, dedicated displays, HDMI, DLNA, digital paper κ.α.) H διάδραση με φορητές συσκευές. Τα δικτυακά πρωτόκολλα επικοινωνίας με περιφερειακές συσκευές και το Διαδίκτυο (wi-fi, bluetooth, radio link, electromagnetic & optical interfacing). Ο μύθος της απεριόριστα εξελίξιμης συσκευής (infinetely fast machine). Η πανταχού παρούσα συσκευή, ο Δικτυακός Προγραμματισμός (Networked Computing) και το Yπολογιστικό Σύννεφο (Cloud Computing). Περιορισμοί στην αλληλεπίδραση με τις φορητές συσκευές.",
  },
  {
    title: "ΣΥΣΤΗΜΑΤΑ ΠΟΛΥΜΕΣΩΝ ",
    description:
      "Επικοινωνία: μοντέλο Shannon-Weaver & μοντέλο Gerbner. Εντροπία, Πλεονασμός. Πολυ-μέσα: Δειγματοληψία, θεώρημα Nyquist, κβάντωση, κωδικοποίηση, διαδραστικά πολυμέσα, μέθοδοι συμπίεσης πληροφορίας πολυμέσων. Υπερμέσα: δομή & βασικά χαρακτηριστικά, ιστορική εξέλιξη, προσαρμοστικά υπερμέσα. Ψηφιακή Εικόνα: ανάλυση & βάθος χρώματος, μορφοποιήσεις αρχείων εικόνας, συμπίεση κατά JPEG, τεχνολογία CCD, σάρωση, εκτύπω-ση, τεχνολογία οθονών. Ψηφιακός Ήχος: μορφοποιήσεις αρχείων εικόνας, κωδικοποίηση mp3. Ψηφιακό Video: τεχνολογία αναλογικού & ψηφιακού video, υποδειγματοληψία σήμα-τος video, συμπίεση κατά MPEG, τεχνική motion compensation. Τεχνικές παραγωγής σχεδι-οκίνησης (animation). Τεχνολογία ροής (streaming media). Τεχνολογία οπτικών ψηφιακών δίσκων (CD, CD-R, CD-RW, DVD).",
  },
  {
    title: "ΘΕΩΡΙΑ ΚΑΙ ΣΥΣΤΗΜΑΤΑ ΛΗΨΗΣ ΑΠΟΦΑΣΕΩΝ",
    description:
      "Εισαγωγή, Λήψη Αποφάσεων υπό Συνθήκες Βεβαιότητας (Πολυκριτηριακές Μέθοδοι Λήψης Απόφασης) Λήψη Αποφάσεων υπό Συνθήκες Άγνοιας, Λήψη Αποφάσεων υπό Συνθήκες Κινδύνου (Θεωρία Πιθανοτήτων, Δίκτυα Bayes, Θεωρία Χρησιμοτήτων), Ακολουθίες Αποφάσεων (Δένδρα Αποφάσεων), Λήψη Αποφάσεων Παρουσία Ανταγωνιστικών Πρακτόρων (Θεωρία Παιγνίων), Λήψη Αποφάσεων με Ανάλυση Δεδομένων (Μηχανική Μάθηση, Ανακάλυψη Γνώσης σε Βάσεις Δεδομένων, Επιχειρηματική Ευφυία.",
  },
  {
    title: "ΤΕΧΝΟΛΟΓΙΑ ΒΑΣΕΩΝ ΔΕΔΟΜΕΝΩΝ",
    description:
      "Βασικά θέματα ΣΔΒΔ. Εισαγωγή στη φυσική οργάνωση ενός ΣΔΒΔ. Μέσα αποθήκευσης. Οργανώσεις Αρχείων και κατάλογοι. Δενδρικοί κατάλογοι και αρχεία (Β-δένδρα, Β+δένδρα, Β*-δένδρα). Τυχαία στατικά και δυναμικά αρχεία (κατακερματισμός). Εξωτερική ταξινόμηση. Διαχείριση απομονωτικής μνήμης. Επανάληψη σχεσιακών πράξεων. Επεξεργασία και βελτιστοποίηση ερωτημάτων. Επεξεργασία συναλλαγών και τεχνικές ταυτοχρονισμού. Τεχνικές ανάκαμψης. Θέματα ασφαλείας και εξουσιοδότησης. Αντικειμενοστραφή και αντικειμενο-σχεσιακά συστήματα. Ημι-δομημένα δεδομένα. Παράλληλα και κατανεμημένα ΣΔΒΔ. Προχωρημένα θέματα.",
  },
  {
    title: "ΘΕΩΡΙΑ ΚΑΙ ΑΛΓΟΡΙΘΜΟΙ ΓΡΑΦΩΝ",
    description:
      "Εισαγωγή. Μονοπάτια και κύκλοι. Δένδρα. Ζευγνύοντα Δένδρα. Συνδεσμικότητα. Επιπεδικότητα. Χρωματισμός. Κατευθυνόμενοι γράφοι. Ροές και Δίκτυα. Αντιστοιχίσεις και καλύμματα.",
  },
  {
    title: "ΠΛΗΡΟΦΟΡΙΑΚΑ ΣΥΣΤΗΜΑΤΑ ΠΑΓΚΟΣΜΙΟΥ ΙΣΤΟΥ",
    description:
      "Βασικές έννοιες για τα Πληροφοριακά Συστήματα Ιστού. Σχεδιασμός και υλοποίηση εφαρμογών για το Διαδίκτυο με χρήση σύγχρονων περιβαλλόντων και τεχνικών (τεχνολογία Java, XML, PHP). Μοντέλα και δομές πληροφορίας για αποδοτική διαχείριση δεδομένων με χρήση εφαρμογών και εργαλείων (PHP, MySQL) για πρόσβαση σε δεδομένα του Παγκόσμιου Ιστού. Υποδομές και πρωτόκολλα για τις εφαρμογές Παγκόσμιου Ιστού. Προχωρημένες λειτουργίες και μικρο-εφαρμογές με χρήση του περιβάλλοντος της Java και με έμφαση στη δια-συνδεσμικότητα της με βάσεις δεδομένων και πληροφοριακά συστήματα. Το περιβάλλον του Κοινωνικού Ιστού και εφαρμογές διαχείρισης δεδομένων με Web 2.0 τεχνολογίες. Μηχανές αναζήτησης Ιστού και λειτουργικότητα τους.",
  },
  {
    title: "ΔΙΑΧΕΙΡΙΣΗ ΔΙΚΤΥΩΝ",
    description:
      "Διαχείριση επικοινωνιακών δικτύων. Η διαχειριστική προσέγγιση TCP/IP και OSI. (NMF, SNMP, SNMPv.2, CMIP, CMISE), Λειτουργικές περιοχές διαχείρισης. Αντικειμενοστραφής μοντελοποίηση. Βάσεις πληροφορίας διαχείρισης (ΜΙΒ). Διαχείριση Τοπικών δικτύων. Διαχείριση δικτύων ΙΡ, ευρυζωνικών δικτύων (ΑΤΜ). Δίκτυα διαχείρισης τηλεπικοινωνιών (ΤΜΝ). Διαχείριση μέσω προγραμμάτων πλοήγησης. Η τεχνητή νοημοσύνη και τα έμπειρα συστήματα στη διαχείριση δικτύων. Λογισμικό διαχείρισης δικτύων.",
  },
  {
    title: "ΑΝΑΠΤΥΞΗ ΕΦΑΡΜΟΓΩΝ ΚΙΝΗΤΩΝ ΣΥΣΚΕΥΩΝ",
    description:
      "Εισαγωγή στην ανάπτυξη εφαρμογών κινητών συσκευών. Προκλήσεις κατά την ανάπτυξη εφαρμογών κινητών συσκευών. Προγραμματισμός με περιορισμένους υπολογιστικούς πόρους. Υλικό και λειτουργικό σύστημα κινητών συσκευών. Ολοκληρωμένα περιβάλλοντα ανάπτυξης εφαρμογών κινητών συσκευών. Βασικές έννοιες σχεδίασης και ανάπτυξης εφαρμογών κινητών συσκευών. Σχεδίαση διεπιφάνειας χρήσης εφαρμογών κινητών συσκευών. Δια-διεργασιακή επικοινωνία. Χειρισμός δεδομένων και ΒΔ σε κινητές συσκευές. Υπηρεσίες προσδιορισμού θέσης κινητών συσκευών. Υπηρεσίες επικοινωνίας και διαδικτύωσης κινητών συσκευών. Χειρισμός και προγραμματισμός αισθητήρων κινητών συσκευών. Αξιολόγηση εφαρμογών φορητών συσκευών.",
  },
  {
    title: "ΣΥΣΤΗΜΑΤΑ ΟΠΤΙΚΩΝ ΕΠΙΚΟΙΝΩΝΙΩΝ",
    description:
      "Βασικές έννοιες αναλογικών-ψηφιακών σημάτων, διαμόρφωση ΟΝ/OFF, διαμόρφωση φάσης, δειγματοληψία, NRZ-RZ δεδομένα, ρυθμός μετάδοσης, εξήγηση σημασίας FOURIER (ΧΩΡΙΣ ΜΑΘΗΜΑΤΙΚΑ), τεχνικές οπτικής πολυπλεξίας (WDM-TDM). Βασικές έννοιες κύματος (πλάτος+φάση), συμβολή, περίθλαση, ταχύτητα ομάδας, ταχύτητα φάσης, δείκτης διάθλασης. Οπτική ίνα και εξασθένηση, μονάδες Db-dBm. Διασπορά, ασκήσεις εξασθένησης & διασποράς. Παθητικές διατάξεις (ΦΙΛΤΡΑ-COUPLERS-SPLITTERS-MUX-DEMUX-OPTICAL ADD/DROP MULTIPLEXERS, RECONFIGURABLE OPTICAL ADD/DROP MULTIPLEXERS). Σύγχρονα οπτικά δίκτυα PON (GPON-XGPON-NGPON-WDMPON-TDMPON-TWDMPON) και διατάξεις, πρωτόκολλα και λειτουργία ενός οπτικού δικτύου PON.",
  },
  {
    title: "ΠΡΟΧΩΡΗΜΕΝΑ ΘΕΜΑΤΑ ΑΡΧΙΤΕΚΤΟΝΙΚΗΣ ΣΥΣΤΗΜΑΤΩΝ",
    description:
      "Επανάληψη της διασωλήνωσης 5-σταδίων, της δυναμικής και υποθετικής εκτέλεσης εντολών και των αρχιτεκτονικών πολλαπλών κύκλων (multicycles). Επανάληψη των εξαρτήσεων και πότε οι εξαρτήσεις οδηγούν σε κενά (bubbles) στην εκτέλεση των εντολών. Στατικές και δυναμικές τεχνικές πρόβλεψης διακλαδώσεων. Πρόβλεψη διακλαδώσεων στον Core Duo και στον Itanium (predication). Δυναμική μετονομασία καταχωρητών στον Core Duo. Επανάληψη της ιεραρχίας κρυφών μνημών. Τεχνικές βελτιστοποίησης των κρυφών μνημών σε επίπεδο υλικού. Τεχνικές αντικαταστάσεις κρυφών μνημών τελευταίου επιπέδου (last level caches). Τεχνικές υλικού και λογισμικού για την εκ των προτέρων προσκόμιση δεδομένων. Τεχνικές βελτιστοποίησης των κρυφών μνημών σε επίπεδο μεταγλωττιστή (μετασχηματισμοί επαναληπτικών βρόχων).",
  },
  {
    title: "ΤΗΛΕΠΙΚΟΙΝΩΝΙΑΚΑ ΣΥΣΤΗΜΑΤΑ",
    description:
      "Το μάθημα περιλαμβάνει τεχνικές διαμόρωσης ανώτερης τάξης: ανάλυση χρόνου & συχνότητας, Γραμμές μεταφοράς και βασικά χαρακτηριστικά τους, Στοχαστικές ανελίξεις και περιγραφή θορύβου, Είδη θορύβων σε κανάλια μετάδοσης και περιγραφή τους, Ενέργεια σήματος και ενέργεια θορύβου, Τεχνικές χαρακτηρισμού καναλιών μετάδοσης (BER, Q-factor, eye diagram, SNR), Γραμμές μεταφοράς βασικής και ζωνοπερατής μετάδοσης, Κανάλια AWGN, Τεχνολογίες υλοποίησης πομπών για τεχνικές διαμόρωσης ανώτερης τάξης και Τεχνολογίες υλοποίησης δεκτών (ομόδυνοι, ετερόδυνοι, θόρυβος σε δέκτες)",
  },
  {
    title: "ΥΠΟΛΟΓΙΣΤΙΚΗ ΟΡΑΣΗ",
    description:
      "Κατάτμηση εικόνας. Οπτική υφή. Χαρακτηριστικά εικόνας. Ταίριασμα εικόνων. Αναζήτηση και ανάκτηση εικόνας. Τοπολογία εικόνας. Περιγραφή διδιάστατων σχημάτων. Κινούμενη εικόνα. Εκτίμηση κίνησης. Παρακολούθηση αντικειμένων. Περιγραφή βίντεο. Αναζήτηση και ανάκτηση βίντεο.",
  },
  {
    title: "ΥΠΟΛΟΓΙΣΤΙΚΗ ΝΟΗΜΟΣΥΝΗ",
    description:
      "Επισκόπηση νευρωνικών δικτύων. Συσχετιστικές μνήμες. Αναδρομικά δίκτυα Hopfield. Αυτο-οργανωνούμενα δίκτυα. Kohonen maps και ανταγωνιστική μάθηση. Προσομοιωμένη ανόπτηση και μηχανή Boltzmann. Νευρωνικά δίκτυα ενισχυτικής μάθησης. Νευρωνικά δίκτυα βαθειάς μάθησης (Deep learning). Βαθειά συνελικτικά δίκτυα. Βαθειά αναδρομικά δίκτυα. Ασαφής λογική, ασαφής μάθηση και ασαφή συστήματα. Γενετικοί και εξελικτικοί αλγόριθμοι βελτιστοποίησης. Αλγόριθμοι βασισμένοι στην νοημοσύνη πληθυσμών (swarm intelligence). Γενετικός προγραμματισμός, Κοινωνιογνωσιακοί και μιμητικοί αλγόριθμοι. Εφαρμογές στην αναγνώριση προτύπων, ρομποτική. Νευροασαφή συστήματα. Υβριδικά συστήματα υπολογιστικής νοημοσύνης στην ανάλυση σήματος, εικόνας και video.",
  },
  {
    title: "ΜΟΥΣΙΚΗ ΠΛΗΡΟΦΟΡΙΚΗ",
    description:
      "Στο μάθημα αυτό αναπτύσσονται οι τεχνολογίες των διεπαφών και των γλωσσών προγραμματισμού του ταχύτατα αναπτυσσόμενου κλάδου της Μουσικής Πληροφορικής, οριοθετούμενου στο μεταίχμιο της επιστήμης (των υπολογιστών) και της τέχνης (της μουσικής). Για πρώτη φορά ο μέσος χρήστης διαθέτει τόση μεγάλη διαδικτυωμένη υπολογιστική ισχύ, συνοδευόμενη από ειδικές πολυμεσικές εφαρμογές που μετατρέπουν τη διεπαφή ανθρώπου-υπολογιστή σε πολυδύναμη μονάδα ακρόασης, σύνθεσης, επεξεργασίας, παραγωγής και διάθεσης μουσικών ακουσμάτων σ' όλο τον κόσμο.",
  },
];
