module.exports = [
  {
    title: "ΕΠΕΞΕΡΓΑΣΙΑ ΣΤΟΧΑΣΤΙΚΟΥ ΣΗΜΑΤΟΣ",
    description:
      "Αξιωματική θεωρία πιθανοτήτων. Επαναλαμβανόμενα πειράματα τύχης. Τυχαία μεταβλητή. Συναρτήσεις τυχαίων μεταβλητών. Στατιστικές ιδιότητες από-κοινού. Ροπές και υπό-συνθήκη στατιστικές ιδιότητες. Στοχαστικά σήματα. Βασικές κατηγορίες στοχαστικών σημάτων (Γκαουσιανό, Μαρκοβιανό, Στάσιμο, Εργοδικό). Στατιστική συνάρτηση αυτοσυσχέτισης και ετεροσυσχέτισης. Σχέση εισόδου-εξόδου γραμμικού συστήματος με στοχαστική διέγερση. Θεωρία βέλτιστων γραμμικών συστημάτων. Εκτίμηση μέσου τετραγωνικού σφάλματος.",
  },
  {
    title: "ΑΝΑΓΝΩΡΙΣΗ ΠΡΟΤΥΠΩΝ - ΣΤΑΤΙΣΤΙΚΗ ΜΑΘΗΣΗ",
    description:
      "Ομαδοποίηση (μη επιβλεπόμενη μάθηση). Κατάταξη/ταξινόμηση (επιβλεπόμενη μάθηση). Συναρτήσεις απόφασης. Εκπαιδευόμενοι αλγόριθμοι κατάταξης με συναρτήσεις απόφασης. Κατάταξη με βάση την απόσταση. Κατάταξη με βάση την θεωρία αποφάσεων. Μάθηση παραμέτρων κατανομών. Ημι-επιβλεπόμενη μάθηση. Ελάττωση διαστάσεων (Ανάλυση πρωτευουσών συνιστωσών, Ανάλυση διακριτικής ικανότητας). Μέθοδοι αναγνώρισης προτύπων με γράφους (Ανάλυση γράφων ομοιότητας και διαδικτύου, Φασματική ομαδοποίηση). Ασαφής λογική και αναγνώριση προτύπων. Γκαουσιανά μειξιακά μοντέλα. Μπαιεσιανά δίκτυα. Εργασίες προγραμματισμού αναγνώρισης προτύπων σε Python, C/C++ ή MATLAB. Βιβλιογραφικές εργασίες.",
  },
  {
    title: "ΥΠΟΛΟΓΙΣΤΙΚΗ ΒΙΟΛΟΓΙΑ",
    description:
      "Εισαγωγή στη βιολογία, και στην υπολογιστική βιολογία. Πρόσβαση σε δεδομένα ακολουθιών (και άλλων στοιχείων), στοίχιση ακολουθιών ανά ζεύγος, BLAST και άλλες μέθοδοι αναζήτησης σε βάσεις δεδομένων, πολλαπλή στοίχιση ακολουθιών, και φυλογένεση. Λειτουργική γονιδιωματική, από το DNA (συμπεριλαμβανομένων στοιχείων αλληλούχισης επόμενης γενεάς) στο RNA (συμπεριλαμβανομένου του RNASeq) και πρωτεινών. Το δένδρο της ζωής από άποψη γονιδιωματικής, ιοί, βακτήρια και αρχαία, και οι ευκαρυώτες.",
  },
  {
    title: "ΔΙΕΠΑΦΕΣ ΦΟΡΗΤΩΝ ΣΥΣΚΕΥΩΝ ",
    description:
      "Περιγραφή των διεπαφών και των λειτουργιών ενός τυπικού φορητού συστήματος. Τα στοιχεία εισόδου (keyboards, chord keyboards, phone pads, handwriting devices, gyroscopes, physical control sensors, iDrives κ.α.) και εξόδου (πολλαπλές οθόνες, μεγάλες -large- οθόνες, situated displays, dedicated displays, HDMI, DLNA, digital paper κ.α.) H διάδραση με φορητές συσκευές. Τα δικτυακά πρωτόκολλα επικοινωνίας με περιφερειακές συσκευές και το Διαδίκτυο (wi-fi, bluetooth, radio link, electromagnetic & optical interfacing). Ο μύθος της απεριόριστα εξελίξιμης συσκευής (infinetely fast machine). Η πανταχού παρούσα συσκευή, ο Δικτυακός Προγραμματισμός (Networked Computing) και το Yπολογιστικό Σύννεφο (Cloud Computing). Περιορισμοί στην αλληλεπίδραση με τις φορητές συσκευές.",
  },
  {
    title: "ΣΥΣΤΗΜΑΤΑ ΠΟΛΥΜΕΣΩΝ ",
    description:
      "Επικοινωνία: μοντέλο Shannon-Weaver & μοντέλο Gerbner. Εντροπία, Πλεονασμός. Πολυ-μέσα: Δειγματοληψία, θεώρημα Nyquist, κβάντωση, κωδικοποίηση, διαδραστικά πολυμέσα, μέθοδοι συμπίεσης πληροφορίας πολυμέσων. Υπερμέσα: δομή & βασικά χαρακτηριστικά, ιστορική εξέλιξη, προσαρμοστικά υπερμέσα. Ψηφιακή Εικόνα: ανάλυση & βάθος χρώματος, μορφοποιήσεις αρχείων εικόνας, συμπίεση κατά JPEG, τεχνολογία CCD, σάρωση, εκτύπω-ση, τεχνολογία οθονών. Ψηφιακός Ήχος: μορφοποιήσεις αρχείων εικόνας, κωδικοποίηση mp3. Ψηφιακό Video: τεχνολογία αναλογικού & ψηφιακού video, υποδειγματοληψία σήμα-τος video, συμπίεση κατά MPEG, τεχνική motion compensation. Τεχνικές παραγωγής σχεδι-οκίνησης (animation). Τεχνολογία ροής (streaming media). Τεχνολογία οπτικών ψηφιακών δίσκων (CD, CD-R, CD-RW, DVD).",
  },
  {
    title: "ΘΕΩΡΙΑ ΚΑΙ ΣΥΣΤΗΜΑΤΑ ΛΗΨΗΣ ΑΠΟΦΑΣΕΩΝ",
    description:
      "Εισαγωγή, Λήψη Αποφάσεων υπό Συνθήκες Βεβαιότητας (Πολυκριτηριακές Μέθοδοι Λήψης Απόφασης) Λήψη Αποφάσεων υπό Συνθήκες Άγνοιας, Λήψη Αποφάσεων υπό Συνθήκες Κινδύνου (Θεωρία Πιθανοτήτων, Δίκτυα Bayes, Θεωρία Χρησιμοτήτων), Ακολουθίες Αποφάσεων (Δένδρα Αποφάσεων), Λήψη Αποφάσεων Παρουσία Ανταγωνιστικών Πρακτόρων (Θεωρία Παιγνίων), Λήψη Αποφάσεων με Ανάλυση Δεδομένων (Μηχανική Μάθηση, Ανακάλυψη Γνώσης σε Βάσεις Δεδομένων, Επιχειρηματική Ευφυία.",
  },
  {
    title: "ΤΕΧΝΟΛΟΓΙΑ ΒΑΣΕΩΝ ΔΕΔΟΜΕΝΩΝ",
    description:
      "Βασικά θέματα ΣΔΒΔ. Εισαγωγή στη φυσική οργάνωση ενός ΣΔΒΔ. Μέσα αποθήκευσης. Οργανώσεις Αρχείων και κατάλογοι. Δενδρικοί κατάλογοι και αρχεία (Β-δένδρα, Β+δένδρα, Β*-δένδρα). Τυχαία στατικά και δυναμικά αρχεία (κατακερματισμός). Εξωτερική ταξινόμηση. Διαχείριση απομονωτικής μνήμης. Επανάληψη σχεσιακών πράξεων. Επεξεργασία και βελτιστοποίηση ερωτημάτων. Επεξεργασία συναλλαγών και τεχνικές ταυτοχρονισμού. Τεχνικές ανάκαμψης. Θέματα ασφαλείας και εξουσιοδότησης. Αντικειμενοστραφή και αντικειμενο-σχεσιακά συστήματα. Ημι-δομημένα δεδομένα. Παράλληλα και κατανεμημένα ΣΔΒΔ. Προχωρημένα θέματα.",
  },
];
