module.exports = [
  {
    title: "ΟΜΑΔΑ ΜΠΑΣΚΕΤ",
    description:
      "Η καλαθοσφαίριση (αγγλικά: basketball), γνωστή και ως μπάσκετ, είναι ένα ομαδικό άθλημα στο οποίο δύο ομάδες πέντε παικτών η καθεμία, που ανταγωνίζονται η μία την άλλη σε ένα ορθογώνιο γήπεδο, παίζουν με τον πρωταρχικό στόχο να σουτάρουν μία μπάλα (περίπου 9,4 ίντσες - 24 εκατοστά- σε διάμετρο) μέσα στην μπασκέτα του αντιπάλου (ένα καλάθι διαμέτρου 18 ιντσών - 46 εκατοστά- τοποθετημένη σε ύψος 10 ποδιών (3,048 μέτρων) σε ένα ταμπλό σε κάθε άκρο του γηπέδου), ενώ ταυτόχρονα να εμποδίσουν την αντίπαλη ομάδα να σουτάρει στην δικιά τους μπασκέτα. Το σουτ αξίζει δύο πόντους, εκτός αν γίνει πίσω από τη γραμμή τριών πόντων, που αξίζει τρεις πόντους. Μετά από ένα φάουλ, το παιχνίδι σταματά και ο παίκτης ο οποίος δέχεται το τεχνικό φάουλ, λαμβάνει μία, δύο ή τρείς ελεύθερες βολές ενός πόντου. Η ομάδα με τους περισσότερους πόντους στο τέλος του παιχνιδιού κερδίζει, αλλά εάν το παιχνίδι λήξει με το σκορ ισόπαλο, οι ομάδες συνεχίζουν σε πεντάλεπτη παράταση.",
    image: {
      url: "https://res.cloudinary.com/dgzlym20q/image/upload/v1657178956/thesis/photo-1608245449230-4ac19066d2d0_wqlkdl.jpg",
      filename: "photo-1608245449230-4ac19066d2d0_wqlkdl.jpg",
    },
  },
  {
    title: "ΟΜΑΔΑ ΠΟΔΟΣΦΑΙΡΟΥ",
    description:
      "Το ποδόσφαιρο είναι ομαδικό άθλημα που παίζεται ανάμεσα σε δύο ομάδες των 11 παικτών με μία σφαιρική μπάλα. Ο ποδοσφαιρικός αγώνας διεξάγεται σε ένα ορθογώνιο γήπεδο με φυσικό ή τεχνητό χλοοτάπητα πράσινου χρώματος και ένα μεταλλικό πλαίσιο στο μέσο κάθε μιας από τις στενές πλευρές, το «τέρμα». Σκοπός της κάθε ομάδας είναι να οδηγήσει την μπάλα στο αντίπαλο τέρμα, δηλαδή «να βάλει γκολ» (από την αγγλική λέξη goal που σημαίνει σκοπός) ή «να σκοράρει», όπως λέγεται στην ειδική ποδοσφαιρική γλώσσα. Οι παίκτες χειρίζονται τη μπάλα κυρίως με τα πόδια, αλλά και με τον κορμό ή το κεφάλι. Η ομάδα που θα επιτύχει τα περισσότερα γκολ ως το τέλος του παιχνιδιού κερδίζει τον αγώνα, ενώ αν καμία ομάδα δεν σκοράρει (η γνωστή ως «λευκή ισοπαλία», 0-0) ή και οι δύο ομάδες καταλήξουν στο τέλος του παιχνιδιού με τον ίδιο αριθμό γκολ σε σκορ, τότε το παιχνίδι λήγει ισόπαλο.",
    image: {
      url: "https://res.cloudinary.com/dgzlym20q/image/upload/v1657179108/thesis/photo-1579952363873-27f3bade9f55_dreyz6.jpg",
      filename: "photo-1579952363873-27f3bade9f55_dreyz6.jpg",
    },
  },
  {
    title: "ΟΜΑΔΑ ΘΕΑΤΡΟΥ",
    description:
      "Το θέατρο ετυμολογικά προέρχεται από το ρήμα θεῶμαι, που σημαίνει βλέπω, παρατηρώ. Είναι η δραματική τέχνη που ακολουθεί ορισμένες συμβάσεις και αναπαριστά μπροστά σε κοινό μια σειρά γεγονότων με τη χρησιμοποίηση ανθρώπων (ηθοποιών) που μιλούν και δρουν. Είναι επίσης το κτίριο, η αίθουσα ή η κατασκευή που προορίζεται για θεατρικές παραστάσεις (λεξικό Τριανταφυλλίδη). Σε αυτόν τον κλάδο της τέχνης που αναφέρεται στη δημιουργία και απόδοση ιστοριών (πραγματικών ή φανταστικών) ζωντανά μπροστά σε κοινό, με τη χρήση κυρίως του λόγου, συνδράμουν και άλλες τέχνες όπως η συγγραφή, τα εικαστικά, η μουσική και ο χορός, με σκοπό την τέρψη και την επιμόρφωση των θεατών. Το θέατρο μπορεί να έχει διάφορες μορφές, όπως είναι ο μονόλογος, η όπερα, το μπαλέτο, η παντομίμα κ.ά.",
    image: {
      url: "https://res.cloudinary.com/dgzlym20q/image/upload/v1657179157/thesis/photo-1582152492243-a32086530356_svg6c8.jpg",
      filename: "photo-1582152492243-a32086530356_svg6c8.jpg",
    },
  },
  {
    title: "ΟΜΑΔΑ CINEMA",
    description:
      "Ο ελληνικός κινηματογράφος περιλαμβάνει ταινίες γυρισμένες στην Ελλάδα, από Έλληνες ή ξένους σκηνοθέτες. Χρονολογικά αλλά και υφολογικά, διακρίνεται στον παλιό ελληνικό κινηματογράφο (μέχρι τη δεκαετία του 1960), το νέο ελληνικό κινηματογράφο (δεκαετίες του 1970 και 1980) και τον σύγχρονο (1990 και μετά). Οι πρώτες απόπειρες έγιναν στις αρχές του 20ού αιώνα και στη διάρκεια του Μεσοπολέμου εμφανίστηκαν οι πρώτες ώριμες ταινίες, όπως η Δάφνις και Χλόη (1931). Κατά την περίοδο 1955-1973, στη λεγόμενη «Χρυσή Εποχή»,[2][3] γυρίστηκαν μερικές από τις γνωστότερες ταινίες, συμπεριλαμβανομένων των Στέλλα (1955) του Μιχάλη Κακογιάννη, Ιστορία μιας κάλπικης λίρας (1955) του Γιώργου Τζαβέλλα, Ο Δράκος (1956) του Νίκου Κούνδουρου, Ποτέ την Κυριακή (1960) του Ζυλ Ντασέν, Τα Κόκκινα Φανάρια (1963) του Βασίλη Γεωργιάδη και των κωμωδιών του Αλέκου Σακελλάριου (Ο Ηλίας του 16ου – 1959, Το ξύλο βγήκε από τον παράδεισο – 1959, Τα κίτρινα γάντια – 1960 κ.ά.).",
    image: {
      url: "https://res.cloudinary.com/dgzlym20q/image/upload/v1657179193/thesis/photo-1478720568477-152d9b164e26_gndwsm.jpg",
      filename: "photo-1478720568477-152d9b164e26_gndwsm.jpg",
    },
  },
  {
    title: "ΟΜΑΔΑ ΧΟΡΟΥ",
    description:
      "Ο χορός γενικά αναφέρεται στην ανθρώπινη κίνηση που χρησιμοποιείται ως μορφή έκφρασης που παρουσιάζεται ως μια κοινωνική, πνευματική είτε ρυθμική απόδοση του ανθρώπινου σώματος. Χρησιμοποιείται επίσης για να περιγράψει τις μεθόδους της μη λεκτικής επικοινωνίας ( γλώσσα του σώματος) μεταξύ των ανθρώπων ή των ζώων (χορός μελισσών, χορός ζευγαρώματος), την κίνηση στα άψυχα αντικείμενα (τα φύλλα χόρεψαν στον αέρα), και ορισμένες μουσικές μορφές. Η χορογραφία είναι η τέχνη της παραγωγής των χορών, και το πρόσωπο που κάνει αυτό καλείται χορογράφος. Οι ορισμοί αυτοί που αποτελούν το χορό εξαρτώνται από τους κοινωνικούς, πολιτιστικούς, αισθητικούς, καλλιτεχνικούς και ηθικούς περιορισμούς, και τη σειρά από τη λειτουργική μετακίνηση (όπως ο λαϊκός χορός) στις κωδικοποιημένες, φιλότεχνες τεχνικές όπως το μπαλέτο.",
    image: {
      url: "https://res.cloudinary.com/dgzlym20q/image/upload/v1657179233/thesis/photo-1547153760-18fc86324498_wnpgsu.jpg",
      filename: "photo-1547153760-18fc86324498_wnpgsu.jpg",
    },
  },
];
